package com.khair.neawsapp;

import android.content.Context;

import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Color;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Random;

public class MainActivity extends AppCompatActivity {

    ListView listView;

    ArrayList<HashMap<String,String>>arrayList=new ArrayList<>();

    HashMap<String,String>hashMap=new HashMap<>();


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        listView=findViewById(R.id.listView);

        caretTable();

        MyAdapter myAdapter=  new MyAdapter();
        listView.setAdapter(myAdapter);











    }
 //*************************************************************************************************
 //=================================================================================================
 //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

private  class MyAdapter extends BaseAdapter{

    @Override
    public int getCount() {
        return arrayList.size();
    }

    @Override
    public Object getItem(int position) {
        return null;
    }

    @Override
    public long getItemId(int position) {
        return 0;
    }

    @Override
    public View getView(int position, View convertView, ViewGroup parent) {
        LayoutInflater inflater= (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
        View myView=inflater.inflate(R.layout.itam,parent,false);

        ImageView Cover=myView.findViewById(R.id.itemCover);
        TextView CAT=myView.findViewById(R.id.itemCAT);
        TextView Tittle=myView.findViewById(R.id.itemTittle);
        TextView Des=myView.findViewById(R.id.itemDes);
        LinearLayout layout=myView.findViewById(R.id.layitem);


        HashMap<String,String>hashMap=arrayList.get(position);
        String itemCAT =hashMap.get("CAT");
        String itemCover =hashMap.get("Images_url");
        String itemTittle =hashMap.get("Item_Tittle");
        String itemDes =hashMap.get("Item_Des");

        Picasso.get().load(itemCover)
                .placeholder(R.drawable.img)
                .into(Cover);

        CAT.setText(itemCAT);
        Tittle.setText(itemTittle);
        Des.setText(itemDes);
        Random rnd = new Random();
        int color = Color.argb(255, rnd.nextInt(256), rnd.nextInt(256), rnd.nextInt(256));
        CAT.setBackgroundColor(color);


        layout.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {

                MainActivity2.Tittle=itemTittle;
                MainActivity2.Des=itemDes;
                Bitmap bitmap= ((BitmapDrawable) Cover.getDrawable()).getBitmap();
                MainActivity2.bitmap=bitmap;

                startActivity( new Intent(MainActivity.this, MainActivity2.class));

            }
        });




        return myView;
    }
}
//===================================================================================================
public void caretTable(){

    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
            "\n" +
            "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
            "\n" +
            "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
            "\n" +
            "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
            "\n" +
            "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
            "\n" +
            "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);




    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);




    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);




    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);



    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);



    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);



    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);



    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);


    hashMap=new HashMap<>();
    hashMap.put("CAT","Tech");
    hashMap.put("Images_url","https://digibanglatech.news/wp-content/uploads/2024/04/Huawei-P70-back-panel.jpg");
    hashMap.put("Item_Tittle","নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে");
    hashMap.put("Item_Des",
            "নতুন স্মার্টফোন আনার ঘোষণা দিয়েছে চীনা প্রযুক্তি জায়ান্ট হুয়াওয়ে। পি সিরিজের আসন্ন এ স্মার্টফোন কিনতে এরই মধ্যে গ্রাহকদের প্রি-বুকিংয়ের সুবিধাও দেওয়া হচ্ছে। খবর রয়টার্স।\n" +
                    "\n" +
                    "খবরে বলা হয়, ২০২৩ সালে কোম্পানিটি মেট৬০ সিরিজের সঙ্গে প্রিমিয়াম স্মার্টফোন মার্কেটে ফিরে আসে। এ সিরিজটি চালু হওয়াকে মার্কিন নিষেধাজ্ঞার ওপর বিজয় হিসেবে চীনের রাষ্ট্রীয় গণমাধ্যমগুলো প্রচার করেছিল। অন্যদিকে দেশটিতে অ্যাপলের আইফোন বিক্রি বন্ধের পদক্ষেপ হিসেবেও একে দায়ী করা হয়েছিল।\n" +
                    "\n" +
                    "মার্কিন বাণিজ্যমন্ত্রী গিনা রাইমন্ডোর চীন ভ্রমণের সময়ে মেট৬০ সিরিজ বাজারে আনা হয়। এ সিরিজের ডিভাইস বাজারজাতের আগে কোম্পানির পক্ষ থেকে কোনো প্রচারণা চালানো হয়নি।\n" +
                    "\n" +
                    "গবেষণা প্রতিষ্ঠান আইডিসির অ্যানালিস্ট উইল উং মনে করেন, হুওয়ায়ে এক ঢিলে দুই পাখি শিকার করেছে। তিনি বলেন, ‘প্রতিষ্ঠানটি মার্কিন-চীন বাণিজ্যযুদ্ধের সময়ে নিরাপদ অবস্থানে থাকতে চেয়েছে।’\n" +
                    "\n" +
                    "বিগত কয়েক মাসে হুয়াওয়ের পি৭০ চালু হওয়া নিয়ে অনেক জল্পনা তৈরি হয়েছে। মডেলটিতে মেট৬০-এর মতোই উন্নতমানের চীনা চিপ থাকবে বলে মনে করছেন প্রযুক্তিবিদরা।\n" +
                    "\n" +
                    "কোম্পানি সূত্রে জানা গেছে, পি সিরিজে রয়েছে উন্নতমানের ক্যামেরা। আকর্ষণীয় ডিজাইনের জন্য এটি বেশ জনপ্রিয়। অন্যদিকে উন্নতমানের মেট সিরিজে পারফরম্যান্স ও বিজনেস ফিচারের ওপর গুরুত্ব দেয়া হয়েছে। নিবন্ধিত গ্রাহকদের যথাসময়ে ফোনের বৈশিষ্ট্য ও রং সম্পর্কে জানতে পারবেন।");

    arrayList.add(hashMap);






}





//===================================================================================================





//*************************************************************************************************
//=================================================================================================
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
}